# GetPtL

## Description
Procedure GetPtL creates a temporary &quot;rubberband&quot; line from a specified point to the user selected end point. This cannot be used if there is a function anywhere in the calling chain.

```pascal
PROCEDURE GetPtL(
				p1X,p2Y     : REAL;
				VAR p2X,p2Y : REAL);
```

```python
def vs.GetPtL(callback):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Coordinates of line start point.|
|p2|REAL|Returns coordinates of mouse click.|

## Remarks
In Python this function will _NOT_ block execution. It will execute a callback function with the resulted line (two points as callback function parameters).

## Examples
#### VectorScript ####
```pascal
PROCEDURE Example;
VAR
pt1, pt2 :VECTOR;
BEGIN
GetPt(pt1.x, pt1.y);
GetPtL(pt1.x, pt1.y, pt2.x, pt2.y);
MoveTo(pt1.x, pt1.y);
LineTo(pt2.x, pt2.y);
END;
RUN(Example);
```
Python sample is similar to the sample in GetPt.
#### Python ####
```python

```

```pascal
target := PickObject(pt.x, pt.y);
WHILE (target = NIL) & (YNDialog(Concat(GetPlugInString(3000), msg, GetPlugInString(3003)))) DO BEGIN
	IF msg = GetPlugInString(3001)
		THEN GetPt(pt.x, pt.y)
		ELSE GetPtL(pt1.x, pt1.y, pt.x, pt.y);
	target := PickObject(pt.x, pt.y);
END;
```
```python
vs.GetPtL(callback)
```

## See Also
VS Functions:
GetPt |
GetPtL |
GetPt3D |
GetPtL3D |
GetLine |
GetLine3D |
GetRect |
GetRect3D |
TrackObject

## Version
Availability: from All Versions

## Category
* User Interactive